---
kind: method
id: M:Autodesk.Revit.DB.MultiReferenceAnnotationOptions.GetElementsToDimension
source: html/72605bc0-cfe6-72be-1531-e0c86ff450f4.htm
---
# Autodesk.Revit.DB.MultiReferenceAnnotationOptions.GetElementsToDimension Method

Gets the elements which the dimension will witness.

## Syntax (C#)
```csharp
public ICollection<ElementId> GetElementsToDimension()
```

## Returns
The elements which the dimension will witness.